const OFFER_TITLES = [
  'Красивная студия в центре города',
  'Уютные однокомнатные апартаменты',
  'Просторная двухкомнатная квартира',
  'Легкий вариант для путешественников',
  'Комфортное жилье для деловых людей',
  'Абсолютно чистая и опрятная квартирка',
  'Новостройка с отличным видом на город',
  'Бюджетное жилье для начинающих',
  'Жилье для тех, кто ценит покой и тишину',
  'Возможность долгосрочной аренды'
];

const OFFER_DESCRIPTIONS = [
  'Приветствую вас! Я рад приветствовать вас в моей уютной студии. Здесь вы найдете все необходимое для комфортного проживания.',
  'В моих однокомнатных апартаментах вы сможете почувствовать себя как дома. Здесь есть всё для отдыха и работы.',
  'Моя двухкомнатная квартира идеально подходит для тех, кто ценит простор и комфорт. Здесь вы найдете всё необходимое для приятного отдыха.',
  'Если вы ищете легкий вариант для краткосрочной аренды, то мои апартаменты идеально подойдут. Здесь вы сможете отдохнуть и восстановиться.',
  'Мои апартаменты предназначен для деловых людей, которым нужен комфортный вариант для проживания в городе. Здесь есть всё необходимое для продуктивной работы.',
  'Я горжусь своей чистотой и опрятностью! В моей квартире вы найдете идеальное место для отдыха и размышлений.',
  'Если вы любите новости и современные технологии, то мой новостройка идеально подойдет. Здесь вы сможете насладиться видом города и комфортным проживанием.',
  'Я предлагаю бюджетное жилье для начинающих. Здесь вы сможете найти свой первый дом и начать новую жизнь.',
  'В моих апартаментах ценят покой и тишину. Если вам нужен уютный уголок для отдыха от шума города, то вы попали в нужное место.',
  'Я предлагаю долгосрочную аренду для тех, кто ищет стабильный вариант проживания. Здесь вы сможете починить дом и создать семью.'
];

const OFFER_PHOTOS = [
  'https://assets.htmlacademy.ru/content/intensive/javascript-1/keksobooking/duonguyen-8LrGtIxxa4w.jpg',
  'https://assets.htmlacademy.ru/content/intensive/javascript-1/keksobooking/brandon-hoogenboom-SNxQGWxZQi0.jpg',
  'https://assets.htmlacademy.ru/content/intensive/javascript-1/keksobooking/claire-rendall-b6kAwr1i0Iw.jpg'
];

const OFFER_TYPES = [
  'palace',
  'flat',
  'house',
  'bungalow',
  'hotel'
];

const OFFER_TYPES_DICT = {
  palace: 'Дворец',
  flat: 'Квартира',
  house: 'Дом',
  bungalow: 'Бунгало',
  hotel: 'Отель'
};

const OFFER_FEATURES = [
  'wifi',
  'dishwasher',
  'parking',
  'washer',
  'elevator',
  'conditioner'
];

const CHECKIN_TIME = [
  '12:00',
  '13:00',
  '14:00'
];

const CHECKOUT_TIME = [
  '12:00',
  '13:00',
  '14:00'
];

const SIMILAR_OFFERS_AMOUNT = 10;

export {
  OFFER_TITLES,
  OFFER_DESCRIPTIONS,
  OFFER_PHOTOS,
  OFFER_TYPES,
  OFFER_TYPES_DICT,
  OFFER_FEATURES,
  CHECKIN_TIME,
  CHECKOUT_TIME,
  SIMILAR_OFFERS_AMOUNT
};
